//Задача №5. Напишите программу, которая на вход принимает одно число (N), а на выходе показывает все целые числа в промежутке от -N до N.
//4 -> "-4, -3, -2, -1, 0, 1, 2, 3, 4"
//2 -> " -2, -1, 0, 1, 2"
//--------------------------------------------

//Решение через while///////////////

//Console.WriteLine("Введите любое число N");
//int n = Convert.ToInt32(Console.ReadLine());

//int count = -n;

//while (count <+ (n+1))
//{
//    Console.Write(count + " ");
//    count++;
//}
//------------------------------------------------
//Решение через цикл for

int n = new Random().Next(1,10);
//int count = -n;

for(int count = -n; count < n+1; count++) 
{
    Console.Write(count + " ");
}

