// РЕКУРСИЯ- ситуация в программировании, при которой метод вызывает сам себя (также понятие в математике)

//1. Задача на факториал

//5! = 5 * 4 * 3 * 2 * 1
//5 * 4!
//4 * 3!
//3 * 2!
//2 * 1!
//---------------------

double Factorial(int n)
{
    if (n == 1) return 1; // т.к. это определение факториала: 1! = 1, 0! = 0 
    else return n * Factorial(n - 1);
}
for (int i = 1; i < 40; i++)
{
    Console.WriteLine($"{i}! = {Factorial(i)}");
}
/*
6! = 720
7! = 5040
8! = 40320
9! = 362880
10! = 3628800
11! = 39916800
12! = 479001600
13! = 1932053504
14! = 1278945280
15! = 2004310016
16! = 2004189184
17! = -288522240- не хватает разрядов для хранения значений типа int, проблема решается заменой на double.
18! = -898433024
19! = 109641728
20! = -2102132736
*/
//------------------------------

//2. Задача на числа Фибоначчи

//f(1) = 1;
//f(2) =2;
//f(n) = f(n-1) + f(n-2);

double Fibonacci(int n)
{
    if (n == 1 || n == 2) return 1;
    else return Fibonacci(n - 1) + Fibonacci(n - 2);
}

for (int i = 1; i < 50; i++)
{
    Console.WriteLine($"{i}! = {Fibonacci(i)}");
}